app/controllers/trips_controller.rb

SELECT  "trips".* FROM "trips"  WHERE "trips"."id" = $1 LIMIT 1  [["id", 1]]
---
  def find_trip
    @trip = Trip.find(params[:id])