app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.to_json

INSERT INTO "users" ("name", "email", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Bob"], ["email", "s@s.com"], ["role", 0], ["created_at", "2015-08-21 17:15:42.654721"], ["updated_at", "2015-08-21 17:15:42.654721"]]
---
  def create
    binding.pry
    # POST with params
    @user = User.new(user_params)
    if @user.save